wolfSSL/wolfBoot/hal/nrf54lm20.h
#define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Pos 0UL
#define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Msk \
    (0x1UL << RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Pos)

#define RRAMC_CONFIG_WEN_Pos          0UL
#define RRAMC_CONFIG_WEN_Msk          (0x1UL << RRAMC_CONFIG_WEN_Pos)

/* TWIM used for PMIC access */
#ifdef NRF_TRUSTZONE_NONSECURE
    #define TWIM20_BASE_DEFAULT       (0x400C6000UL)
#else
    #define TWIM20_BASE_DEFAULT       (0x500C6000UL)
#endif

#define PMIC_TWIM_BASE                TWIM20_BASE_DEFAULT

#define TWIM_TASKS_STOP(base)         (*((volatile uint32_t *)((base) + 0x004)))
#define TWIM_TASKS_DMA_RX_START(base) (*((volatile uint32_t *)((base) + 0x028)))
#define TWIM_TASKS_DMA_TX_START(base) (*((volatile uint32_t *)((base) + 0x050)))
#define TWIM_EVENTS_STOPPED(base)     (*((volatile uint32_t *)((base) + 0x104)))
#define TWIM_EVENTS_ERROR(base)       (*((volatile uint32_t *)((base) + 0x114)))
#define TWIM_EVENTS_LASTRX(base)      (*((volatile uint32_t *)((base) + 0x134)))
#define TWIM_EVENTS_LASTTX(base)      (*((volatile uint32_t *)((base) + 0x138)))
#define TWIM_EVENTS_DMA_RX_END(base)  (*((volatile uint32_t *)((base) + 0x14C)))
#define TWIM_EVENTS_DMA_TX_END(base)  (*((volatile uint32_t *)((base) + 0x168)))
#define TWIM_SHORTS_REG(base)         (*((volatile uint32_t *)((base) + 0x200)))
#define TWIM_ERRORSRC_REG(base)       (*((volatile uint32_t *)((base) + 0x4C4)))
#define TWIM_ENABLE_REG(base)         (*((volatile uint32_t *)((base) + 0x500)))
#define TWIM_FREQUENCY_REG(base)      (*((volatile uint32_t *)((base) + 0x524)))
#define TWIM_ADDRESS_REG(base)        (*((volatile uint32_t *)((base) + 0x588)))
#define TWIM_PSEL_SCL_REG(base)       (*((volatile uint32_t *)((base) + 0x600)))
#define TWIM_PSEL_SDA_REG(base)       (*((volatile uint32_t *)((base) + 0x604)))
#define TWIM_DMA_RX_PTR(base)         (*((volatile uint32_t *)((base) + 0x704)))
#define TWIM_DMA_RX_MAXCNT(base)      (*((volatile uint32_t *)((base) + 0x708)))
#define TWIM_DMA_RX_TERMINATE(base)   (*((volatile uint32_t *)((base) + 0x71C)))
#define TWIM_DMA_TX_PTR(base)         (*((volatile uint32_t *)((base) + 0x73C)))
#define TWIM_DMA_TX_MAXCNT(base)      (*((volatile uint32_t *)((base) + 0x740)))
#define TWIM_DMA_TX_TERMINATE(base)   (*((volatile uint32_t *)((base) + 0x754)))

#define TWIM_TASKS_STOP_TASKS_STOP_Trigger           0x1UL
#define TWIM_TASKS_DMA_RX_START_START_Trigger        0x1UL
#define TWIM_TASKS_DMA_TX_START_START_Trigger        0x1UL
#define TWIM_ENABLE_ENABLE_Disabled                  0x0UL
#define TWIM_ENABLE_ENABLE_Enabled                   0x6UL
#define TWIM_FREQUENCY_FREQUENCY_K100                0x01980000UL
#define TWIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Enabled 0x1UL
#define TWIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Enabled 0x1UL
#define TWIM_SHORTS_LASTTX_DMA_RX_START_Msk          (0x1UL << 7)
#define TWIM_SHORTS_LASTTX_STOP_Msk                  (0x1UL << 9)
#define TWIM_SHORTS_LASTRX_STOP_Msk                  (0x1UL << 12)

/* Global RTC (GRTC) */
#ifdef NRF_TRUSTZONE_NONSECURE
    #define GRTC_BASE_DEFAULT        (0x400E2000UL)
#else
    #define GRTC_BASE_DEFAULT        (0x500E2000UL)
#endif
#define GRTC_BASE                  GRTC_BASE_DEFAULT
#define GRTC_TASKS_CAPTURE(n)      (*((volatile uint32_t *)(GRTC_BASE + 0x000 + ((n) * 0x4))))
#define GRTC_TASKS_START           (*((volatile uint32_t *)(GRTC_BASE + 0x060)))
#define GRTC_TASKS_STOP            (*((volatile uint32_t *)(GRTC_BASE + 0x064)))
#define GRTC_TASKS_CLEAR           (*((volatile uint32_t *)(GRTC_BASE + 0x068)))
#define GRTC_EVENTS_COMPARE(n)     (*((volatile uint32_t *)(GRTC_BASE + 0x100 + ((n) * 0x4))))
#define GRTC_CC_CCL(n)             (*((volatile uint32_t *)(GRTC_BASE + 0x520 + ((n) * 0x10))))
#define GRTC_CC_CCH(n)             (*((volatile uint32_t *)(GRTC_BASE + 0x524 + ((n) * 0x10))))
#define GRTC_CC_CCADD(n)           (*((volatile uint32_t *)(GRTC_BASE + 0x528 + ((n) * 0x10))))
#define GRTC_CC_CCEN(n)            (*((volatile uint32_t *)(GRTC_BASE + 0x52C + ((n) * 0x10))))
#define GRTC_EVTEN                 (*((volatile uint32_t *)(GRTC_BASE + 0x400)))
#define GRTC_EVTENSET              (*((volatile uint32_t *)(GRTC_BASE + 0x404)))
#define GRTC_EVTENCLR              (*((volatile uint32_t *)(GRTC_BASE + 0x408)))
#define GRTC_SYSCOUNTERL(n)        (*((volatile uint32_t *)(GRTC_BASE + 0x720 + ((n) * 0x10))))
#define GRTC_SYSCOUNTERH(n)        (*((volatile uint32_t *)(GRTC_BASE + 0x724 + ((n) * 0x10))))
#define GRTC_SYSCOUNTER_ACTIVE(n)  (*((volatile uint32_t *)(GRTC_BASE + 0x728 + ((n) * 0x10))))
#define GRTC_STATUS_LFTIMER        (*((volatile uint32_t *)(GRTC_BASE + 0x6B0)))
#define GRTC_MODE                  (*((volatile uint32_t *)(GRTC_BASE + 0x510)))

#define GRTC_EVTEN_COMPARE_Msk(idx)    (1UL << (idx))

#define GRTC_TASKS_START_TASKS_START_Trigger    0x1UL
#define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Trigger 0x1UL
#define GRTC_CC_CCADD_VALUE_Pos                 0UL
#define GRTC_CC_CCADD_VALUE_Msk                 (0x7FFFFFFFUL << GRTC_CC_CCADD_VALUE_Pos)
#define GRTC_CC_CCADD_REFERENCE_Pos              31UL
#define GRTC_CC_CCADD_REFERENCE_CC              (0x1UL << GRTC_CC_CCADD_REFERENCE_Pos)
#define GRTC_CC_CCEN_ACTIVE_Pos                 0UL
#define GRTC_CC_CCEN_ACTIVE_Msk                 (0x1UL << GRTC_CC_CCEN_ACTIVE_Pos)
#define GRTC_CC_CCEN_ACTIVE_Enable              (0x1UL << GRTC_CC_CCEN_ACTIVE_Pos)
#define GRTC_CC_CCH_CCH_Pos                     0UL
#define GRTC_CC_CCH_CCH_Msk                     (0xFFFFFUL << GRTC_CC_CCH_CCH_Pos)
#define GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Pos   0UL
#define GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk   (0xFFFFFUL << GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Pos)
#define GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos       0UL
#define GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Msk       (0x1UL << GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos)
#define GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Active    (0x1UL << GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos)
#define GRTC_STATUS_LFTIMER_READY_Pos           0UL
#define GRTC_STATUS_LFTIMER_READY_Msk           (0x1UL << GRTC_STATUS_LFTIMER_READY_Pos)
#define GRTC_MODE_AUTOEN_Pos                    0UL
#define GRTC_MODE_AUTOEN_Msk                    (0x1UL << GRTC_MODE_AUTOEN_Pos)
#define GRTC_MODE_SYSCOUNTEREN_Pos              1UL
#define GRTC_MODE_SYSCOUNTEREN_Msk              (0x1UL << GRTC_MODE_SYSCOUNTEREN_Pos)
#define GRTC_COUNTER_MASK                       ((1ULL << 52) - 1ULL)

/* GPIO */
#ifdef NRF_TRUSTZONE_NONSECURE
    #define GPIO_P0_NS_BASE              (0x4010A000UL)
    #define GPIO_P1_NS_BASE              (0x400D8200UL)
    #define GPIO_P2_NS_BASE              (0x40050400UL)
    #define GPIO_P3_NS_BASE              (0x400D8600UL)
#else
    #define GPIO_P0_S_BASE               (0x5010A000UL)
    #define GPIO_P1_S_BASE               (0x500D8200UL)
    #define GPIO_P2_S_BASE               (0x50050400UL)
    #define GPIO_P3_S_BASE               (0x500D8600UL)
#endif

