wolfSSL/wolfBoot/hal/nrf54lm20.h
/* GPIO configuration */
#ifdef NRF_TRUSTZONE_NONSECURE
    #define GPIO_PORT0_BASE_DEFAULT     GPIO_P0_NS_BASE
    #define GPIO_PORT1_BASE_DEFAULT     GPIO_P1_NS_BASE
    #define GPIO_PORT2_BASE_DEFAULT     GPIO_P2_NS_BASE
    #define GPIO_PORT3_BASE_DEFAULT     GPIO_P3_NS_BASE
#else
    #define GPIO_PORT0_BASE_DEFAULT     GPIO_P0_S_BASE
    #define GPIO_PORT1_BASE_DEFAULT     GPIO_P1_S_BASE
    #define GPIO_PORT2_BASE_DEFAULT     GPIO_P2_S_BASE
    #define GPIO_PORT3_BASE_DEFAULT     GPIO_P3_S_BASE
#endif

#define GPIO0_BASE     GPIO_PORT0_BASE_DEFAULT
#define GPIO1_BASE     GPIO_PORT1_BASE_DEFAULT
#define GPIO2_BASE     GPIO_PORT2_BASE_DEFAULT
#define GPIO3_BASE     GPIO_PORT3_BASE_DEFAULT

static inline uintptr_t hal_gpio_port_base(unsigned int port)
{
    switch (port) {
    case 0:
        return (uintptr_t)GPIO0_BASE;
    case 1:
        return (uintptr_t)GPIO1_BASE;
    case 2:
        return (uintptr_t)GPIO2_BASE;
    case 3:
        return (uintptr_t)GPIO3_BASE;
    default:
        return (uintptr_t)GPIO0_BASE;
    }
}

#define GPIO_BASE(n)        hal_gpio_port_base((unsigned int)(n))
#define GPIO_OUT(n)         *((volatile uint32_t *)(GPIO_BASE(n) + 0x000))
#define GPIO_OUTSET(n)      *((volatile uint32_t *)(GPIO_BASE(n) + 0x004))
#define GPIO_OUTCLR(n)      *((volatile uint32_t *)(GPIO_BASE(n) + 0x008))
#define GPIO_DIRSET(n)      *((volatile uint32_t *)(GPIO_BASE(n) + 0x014))
#define GPIO_DIRCLR(n)      *((volatile uint32_t *)(GPIO_BASE(n) + 0x018))
#define GPIO_PIN_CNF(n, p)  *((volatile uint32_t *)(GPIO_BASE(n) + 0x080 + ((p) * 0x4)))

#define GPIO_CNF_IN                 0       // input
#define GPIO_CNF_OUT                1       // output
#define GPIO_CNF_IN_DIS             2       // input, disconnect input buffer
#define GPIO_CNF_OUT_DIS            3       // output, disconnect input buffer
#define GPIO_CNF_PULL_DIS           0
#define GPIO_CNF_PULL_UP            (3UL << 2)
#define GPIO_CNF_PULL_DOWN          (1UL << 2)
#define GPIO_CNF_STD_DRIVE_0        0
#define GPIO_CNF_HIGH_DRIVE_0       (1UL << 8)     // High drive
#define GPIO_CNF_EXTRA_HIGH_DRIVE_0 (3UL << 8)     // Extra-High drive
#define GPIO_CNF_STD_DRIVE_1        0
#define GPIO_CNF_HIGH_DRIVE_1       (1UL << 10)     // High drive
#define GPIO_CNF_EXTRA_HIGH_DRIVE_1 (3UL << 10)     // Extra-High drive
#define GPIO_CNF_SENSE_NONE         0
#define GPIO_CNF_MCUSEL(n)          (((n) & 0x7) << 28)


/* UART */

// UART Device     P0   P1   P2   P3
// -----------------------------------
// NRF_UARTE00               XX        <-- has dedicated pins on P2
// NRF_UARTE20          XX        XX
// NRF_UARTE21          XX        XX
// NRF_UARTE22          XX        XX
// NRF_UARTE23          XX        XX
// NRF_UARTE24          XX        XX
// NRF_UARTE30     XX

#define UARTE20_S_BASE     0x500C6000UL   // monitor
#define UARTE30_S_BASE     0x50104000UL   // download

#define DEVICE_MONITOR     1
#define DEVICE_DOWNLOAD    2

// setup for DK board
#define PORT_MONITOR       1
#define PIN_TX_MONITOR     11
#define PIN_RX_MONITOR     12
#define BASE_ADDR_MONITOR  UARTE20_S_BASE

// setup for DK board
#define PORT_DOWNLOAD      0
#define PIN_TX_DOWNLOAD    6
#define PIN_RX_DOWNLOAD    7
#define BASE_ADDR_DOWNLOAD UARTE30_S_BASE

static inline uintptr_t hal_uart_port_base(int device)
{
    switch (device) {
    case DEVICE_DOWNLOAD:
        return (uintptr_t) BASE_ADDR_DOWNLOAD;
    case DEVICE_MONITOR:
    default:
        return (uintptr_t) BASE_ADDR_MONITOR;
    }
}

static inline int hal_uart_port_num(int device)
{
    switch (device) {
    case DEVICE_DOWNLOAD:
        return (int) PORT_DOWNLOAD;
    case DEVICE_MONITOR:
    default:
        return (int) PORT_MONITOR;
    }
}

static inline int hal_uart_pin_num_tx(int device)
{
    switch (device) {
    case DEVICE_DOWNLOAD:
        return (int) PIN_TX_DOWNLOAD;
    case DEVICE_MONITOR:
    default:
        return (int) PIN_TX_MONITOR;
    }
}

static inline int hal_uart_pin_num_rx(int device)
{
    switch (device) {
    case DEVICE_DOWNLOAD:
        return (int) PIN_RX_DOWNLOAD;
    case DEVICE_MONITOR:
    default:
        return (int) PIN_RX_MONITOR;
    }
}

/* UART Addressing */
#define UART_PORT_NUM(n)               hal_uart_port_num((unsigned int)(n))
#define UART_PIN_NUM_TX(n)             hal_uart_pin_num_tx((unsigned int)(n))
#define UART_PIN_NUM_RX(n)             hal_uart_pin_num_rx((unsigned int)(n))
#define UART_BASE(n)                   hal_uart_port_base((unsigned int)(n))

#define UART_PSEL_TXD(n)               *((volatile uint32_t *)(UART_BASE(n) + 0x604 + 0x000))
#define UART_PSEL_CTS(n)               *((volatile uint32_t *)(UART_BASE(n) + 0x604 + 0x004))
#define UART_PSEL_RXD(n)               *((volatile uint32_t *)(UART_BASE(n) + 0x604 + 0x008))
#define UART_PSEL_RTS(n)               *((volatile uint32_t *)(UART_BASE(n) + 0x604 + 0x00C))
#define UART_ENABLE(n)                 *((volatile uint32_t *)(UART_BASE(n) + 0x500))
#define UART_BAUDRATE(n)               *((volatile uint32_t *)(UART_BASE(n) + 0x524))
#define UART_CONFIG(n)                 *((volatile uint32_t *)(UART_BASE(n) + 0x56C))

#define UART_DMA_TX_PTR(n)             *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x038 + 0x004))
#define UART_DMA_TX_MAXCNT(n)          *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x038 + 0x008))

#define UART_DMA_RX_PTR(n)             *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x000 + 0x004))
#define UART_DMA_RX_MAXCNT(n)          *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x000 + 0x008))
#define UART_DMA_RX_AMOUNT(n)          *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x000 + 0x00C))

#define UART_EVENTS_DMA_TX_END(n)      *((volatile uint32_t *)(UART_BASE(n) + 0x14C + 0x01C + 0x000))
#define UART_EVENTS_DMA_TX_BUSERROR(n) *((volatile uint32_t *)(UART_BASE(n) + 0x14C + 0x01C + 0x008))
#define UART_EVENTS_DMA_RX_END(n)      *((volatile uint32_t *)(UART_BASE(n) + 0x14C + 0x000 + 0x000))
#define UART_EVENTS_DMA_RX_BUSERROR(n) *((volatile uint32_t *)(UART_BASE(n) + 0x14C + 0x000 + 0x008))

#define UART_TASKS_DMA_TX_START(n)     *((volatile uint32_t *)(UART_BASE(n) + 0x028 + 0x028 + 0x000))
#define UART_TASKS_DMA_TX_STOP(n)      *((volatile uint32_t *)(UART_BASE(n) + 0x028 + 0x028 + 0x004))

